---
kind: method
id: M:Autodesk.Revit.DB.SKPImportOptions.#ctor
source: html/f1516370-a5ff-bdac-1555-2a09784cb58f.htm
---
# Autodesk.Revit.DB.SKPImportOptions.#ctor Method

Constructs a new instance of SKPImportOptions with default values of all properties.

## Syntax (C#)
```csharp
public SKPImportOptions()
```